<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE>Index of Documentation - Roboterarm Simulation - JADD - Just Another DelphiDoc</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 3.1  (Win32)">
	<META NAME="CREATED" CONTENT="0;0">
	<META NAME="CHANGEDBY" CONTENT="Thomas Gattinger">
	<META NAME="CHANGED" CONTENT="20100617;72300">
	<META NAME="KEYWORDS" CONTENT="Index, Content">
	<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<TABLE WIDTH=100% CELLPADDING=2 CELLSPACING=2 STYLE="page-break-before: always">
	<TR>
		<TD>
			<P ALIGN=CENTER><A HREF="">Index</A></P>
		</TD>
		<TD>
			<P ALIGN=CENTER><A HREF="FileList.html">Files</A></P>
		</TD>
		<TD>
			<P ALIGN=CENTER><A HREF="RecordList.html">Records</A></P>
		</TD>
		<TD>
			<P ALIGN=CENTER><A HREF="ObjectList.html">Objects</A></P>
		</TD>
		<TD>
			<P ALIGN=CENTER><A HREF="ClassList.html">Classes</A></P>
		</TD>
		<TD>
			<P ALIGN=CENTER><A HREF="InterfaceList.html">Interfaces</A></P>
		</TD>
		<TD>
			<P ALIGN=CENTER><A HREF="DispInterfaceList.html">Dispatch-Interfaces</A></P>
		</TD>
	</TR>
</TABLE>
<HR>
<P>This is the index of the documentation generated by JADD - Just
Another DelphiDoc.<BR>Documentation has been generated at 23:35:17 on
Mittwoch, 16. Juni 2010.<BR><BR><FONT SIZE=4 STYLE="font-size: 16pt"><B>Abschluss
Projekt &quot;Roboterarm&quot;</B></FONT></P>
<P>Hiermit m&ouml;chten wir (Thomas Gattinger, Thomas Rittinger,
Fr&eacute;d&eacute;ric Nickol) unser Abschlussprojekt<BR>f&uuml;r das
erste Lehrjahr im Lernfeld 6 vorstellen.</P>
<P>Unser Projekt stellt ein in OpenGl realisiertes 3D-Modell des
ARO-Roboterarms dar.<BR>Auf die Idee f&uuml;r dieses Projekt kamen
wir recht fr&uuml;h im Laufe des ersten Lehrjahres, da Herr Wintgen
uns erz&auml;hlte wie vorteilhaft eine Visualisierung des Roboterarms
w&auml;re.</P>
<P>Nach einer langen Suche nach geeigneten OpenGl-Tutorials und
einigen vergeblich Versuchen stie&szlig; Thomas Rittinger auf
folgende Seite:<BR><A HREF="http://wiki.delphigl.com/index.php/Hauptseite">http://wiki.delphigl.com/index.php/Hauptseite</A><A HREF="http://wiki.delphigl.com/index.php/Hauptseite"><BR></A>Dort
sind einige sehr gute Tutorials vorhanden, sowie eine eigene
OpenGl-Lib, welche wir dann auch f&uuml;r das Projekt verwendeten.</P>
<P>Zu Beginn wurde nat&uuml;rlich viel ausprobiert, beispielsweise
welche Elemente am besten geeignet sind f&uuml;r den Aufbau des Arms.
So befanden wir relativ schnell dass sich Zylinder am besten daf&uuml;r
eignen w&uuml;rden. Daraufhin begannen wir an einem Projekt und
versuchten uns an die Eigenheiten von OpenGl zu gew&ouml;hnen bzw.
diese zu verstehen.</P>
<P>Erste gr&ouml;&szlig;ere Probleme traten bei den Rotationen der
einzelnen Elemente auf. Die Rotation in OpenGl wird nicht durch das
Drehen des Objekts, sondern durch das Rotieren des Betrachters um das
Objekt bewerkstelligt. Dies f&uuml;hrte zu einiger Verwirrung.
Desweiteren erwies es sich als umst&auml;ndlich Elemente in
Abh&auml;ngigkeit von anderen Elementen rotieren zu lassen. 
</P>
<P>Das anf&auml;ngliche Testprojekt entwickelte sich nun immer weiter
und wurde schlie&szlig;lich das Hauptprojekt. Nur war es auch durch
diese Tatsache nicht sonderlich gut strukturiert. Thomas Gattinger
nahm sich dann zum Ziel das ganze Projekt zu strukturieren, einige
Fehler auszubessern und es als eigene Delphi-Komponente zu
realisieren.</P>
<P>Wie in dem Projekt zu sehen wird der Arm durch 6 Schieberegler
gesteuert.</P>
<P>Servo 0: L&auml;sst den Deckel des Standfu&szlig;es rotieren.
Abh&auml;nghig davon werden die restlichen Elemente ebenfalls
gedreht.</P>
<P>Servo 1&amp;2: Dieser regler &quot;kippt&quot; den Arm nach vorne
bzw. hinten.</P>
<P>Servo 3: Das Gelenk am Ende des ersten Armelements wird gedreht.
Der Arm &quot;&ouml;ffnet&quot; bzw. &quot;schliesst&quot; sich.</P>
<P>Servo 4: Die Greifhand wird gekippt.</P>
<P>Servo 5: Die Greifhand wird um die eigene Achse gedreht.</P>
<P>Servo 6: Hiermit wird die &quot;Hand&quot; ge&ouml;ffnet bzw.
geschlossen.</P>
<P>Au&szlig;erdem k&ouml;nnen die minimale wie maximale Gradzahl
angegeben werden. Dadurch kann der Arm in seiner Beweglichkeit
eingeschr&auml;nkt werden. Dies ist f&uuml;r die Simulation an sich
wichtig, da der original Arm sich ja auch nicht &uuml;berall um 360&deg;
drehen kann und au&szlig;erdem da bisher noch keine Kollisionsabfrage
implementiert ist. Desweiteren k&ouml;nnen noch einige Extras
hinzugeschaltet werden.</P>
<P>Zeige Koordinatensystem		: Die X-, Y- und Z-Achse werden zur
Orientierung angezeigt.</P>
<P>Zeige geometrischen Objektmittelpunkt	: Der Mittelpunkt eines
jeden Objektes wird angezeigt. Dies ist gleichzeitig der Mittelpunkt
der objekteigenen Matrix.</P>
<P>Zeige Rotationsmakierung		: Hilfspfeile werden eingeblendet, an
denen es leichter ersichtlich ist in welche Richtung sich das Element
dreht.</P>
<P>Deaktiviere Texturen			: Die voreingestellten Texturen werden
ausgeblendet und der Roboterarm als Gitternetz angezeigt.</P>
<P><BR><BR>
</P>
<P><B>Liste der bekannten Bugs, die in dieser Version nicht mehr
behoben wurden, da sie bereits in der neuen Version gefixt wurden
oder nur in der neuen Version noch zu ber&uuml;cksichtigen sind.</B></P>
<OL>
	<LI><P>Das Laden der Texturen f&uuml;r die letzten beiden Elemente
	schl&auml;gt in einigen F&auml;llen fehl. Statt den Texturen werden
	die Elemente dann schwarz eingef&auml;rbt. Texturen werden in der
	neuen Version nicht mehr ben&ouml;tigt.</P>
	<LI><P>Eine Kollisionsabfrage ist noch nicht vorgesehen, dadurch
	k&ouml;nnen sich die einzelnen Elemente ineinander bewegen.</P>
	<LI><P>Die Reset-Funktionalit&auml;t mit einem Doppelklick ist noch
	fehlerhaft. Dieser Bug ist in der neuen Version bereits gefixt.</P>
	<LI><P>Teilweise sind die Oberfl&auml;chen der Elemente genau
	verdreht. Fl&auml;chen, die von OpenGL als &bdquo;oben&ldquo;
	definiert sind zeigen nach unten und umgekehrt. Dieser Bug ist
	ebenfalls in der neuen Version gefixt. Wird erst durch Lichteffekte
	sichtbar!</P>
	<LI><P>Es fehlen noch R&uuml;ckgabeschnittstelle der Simulation, um
	auf Falscheingaben das aufrufende Formular zu informieren. So werden
	beispielsweise fehlerhafte Inhalte der Textfelder Min-,
	Maxgradwerten nicht korrigiert. In der neuen Version kann dies &uuml;ber
	das implementierte Observer-Pattern bewerkstelligt werden, indem man
	sich das Model der Komponente holt und sich selbst als Observer
	registriert.</P>
</OL>
<P><BR>The <A HREF="LongFunctions.html">list of long functions</A>.<BR><BR>The
<A HREF="Index_A.html">Index of all identifiers and files</A>.</P>
</BODY>
</HTML>